# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license
# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 21
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
    - [ 10, 13, 16, 30, 33, 23 ] # P3/8
    - [ 30, 61, 62, 45, 59, 119 ] # P4/16
    - [ 116, 90, 156, 198, 373, 326 ] # P5/32

   # Mobilenetv3-small backbone
   # MobileNetV3_InvertedResidual [out_ch, hid_ch, k_s, stride, SE, HardSwish]
backbone:
  # [from, number, module, args]
  [[-1, 1, conv_bn_hswish, [16, 2]],             # 0-p1/2   320*320
   [-1, 1, MobileNetV3, [16,  16, 3, 2, 1, 0]],  # 1-p2/4   160*160
   [-1, 1, MobileNetV3, [24,  72, 3, 2, 0, 0]],  # 2-p3/8   80*80
   [-1, 1, MobileNetV3, [24,  88, 3, 1, 0, 0]],  # 3        80*80 1
   [-1, 1, MobileNetV3, [40,  96, 5, 2, 1, 1]],  # 4-p4/16  40*40
   [-1, 1, MobileNetV3, [40, 240, 5, 1, 1, 1]],  # 5        40*40
   [-1, 1, MobileNetV3, [40, 240, 5, 1, 1, 1]],  # 6        40*40
   [-1, 1, MobileNetV3, [48, 120, 5, 1, 1, 1]],  # 7        40*40
   [-1, 1, MobileNetV3, [48, 144, 5, 1, 1, 1]],  # 8        40*40 1
   [-1, 1, MobileNetV3, [96, 288, 5, 2, 1, 1]],  # 9-p5/32  20*20
   [-1, 1, MobileNetV3, [96, 576, 5, 1, 1, 1]],  # 10       20*20
   [-1, 1, MobileNetV3, [96, 576, 5, 1, 1, 1]],  # 11       20*20
   [-1, 1, SPPF, [576, 5]]
  ]

head:
  [[-1, 1, Conv, [96, 1, 1]],#12 1
   [-1, 1, CA, []], # 13
   [-1, 1, nn.Conv2d, [144, 1, 1]], # 14
   [-1, 3, C3_ContextDown, [144, False]], # 15 P5  小目标

   [8, 1, CA, []], #16
   [-1, 1, nn.Conv2d, [72, 1, 1]],  # 17

   [15, 1, nn.ConvTranspose2d, [72, 3, 2, 1, 1]], # 18
   [-1, 1, CA, [4, False]], #19
   [[-1, 18], 1, multiply, []], # 20
   [[-1, 19], 1, Add, []], # 21
   [-1, 3, C3_ContextDown, [288, False]], # 22 P4 中目标

   [3, 1, CA, []], # 23
   [-1, 1, nn.Conv2d, [88, 1, 1]], # 24

   [19, 1, nn.ConvTranspose2d, [88, 3, 2, 1, 1]], # 25
   [-1, 1, CA, [4, False]], # 26
   [[-1, 25], 1, multiply, []], # 27
   [[-1, 26], 1, Add, []], # 28
   [-1, 3, C3_ContextDown, [576, False]], # 29 P3 大目标

   [[30, 23, 16], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]